CanHaveTypeAssigned Method
 Identifies if the element can have a type assigned.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public bool CanHaveTypeAssigned()
  Visual Basic
Public Function CanHaveTypeAssigned As Boolean
  Visual C++
public:
bool CanHaveTypeAssigned()
 Return Value
 True if element can have a type assigned, false otherwise.
 Remarks
 Some elements cannot have type assigned, in which case invalid element id is considered to be their type id.
 See Also
  Element Class
  CanHaveTypeAssigned Overload
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →